damBreakLaminar/0/nut
dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    down
    {
        type            symmetryPlane;
    }
    up
    {
        type            calculated;
        value           uniform 0;
    }
    walls
    {
        type            empty;
    }
}